app/Controllers/Optik.php

    public function update($idoptik)
    {
        // Cek No. Ref: Validasi unik (is_unique) di form ubah.
        $optikLama = $this->OptikModel->getOptik($this->request->getVar('no_order'));
        if ($optikLama['no_ref'] == $this->request->getVar('no_ref')) {
            $rule_noref = 'required';
        } else {
            $rule_noref = 'required|is_unique[orders.no_ref]';
        }

        // Validasi Form
        if (!$this->validate([
            'no_ref' => [
                'rules' => $rule_noref,
                'errors' => [
                    'required' => '{field} harus diisi',
                    'is_unique' => '{field} sudah terdaftar'
                ]
            ]
        ])) {
            return redirect()->to('/optik/ubah/' . $this->request->getVar('no_order'))->withInput();
        }

        // Simpan data yang diperbarui ke database
        $this->OptikModel->save([
            'no_order' => $idoptik,
            'no_ref' => $this->request->getVar('no_ref'),
            'nama' => $this->request->getVar('nama'),
            'telepon' => $this->request->getVar('telepon'),
            'tgl_pesan' => $this->request->getVar('tgl_pesan'),
            'karyawan' => $this->request->getVar('karyawan'),
            'total_modal' => $this->request->getVar('total_modal'),
            'total_jual' => $this->request->getVar('total_jual'),
            'total_bayar' => $this->request->getVar('total_bayar'),
            'keuntungan' => $this->request->getVar('keuntungan')
        ]);
---
UPDATE `orders` SET `no_ref` = '251005', `nama` = 'Eko Prasetyo', `telepon` = '089988776655', `tgl_pesan` = '2025-10-03', `karyawan` = 'Bagus', `total_modal` = '320000', `total_jual` = '400000', `total_bayar` = '400000', `keuntungan` = '80000'
WHERE `orders`.`no_order` IN ('10005')