app/Models/OptikModel.php

    public function getOptik($idoptik = false){
        if($idoptik === false){
            return $this->findAll();
        }
            return $this->where(['no_order' => $idoptik])->first();
---
SELECT *
FROM `orders`
WHERE `no_order` = '10005'
 LIMIT 1